hirokuma/nrf51822_templete/main.c
/*
 * Copyright (c) 2012-2014, hiro99ma
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *         this list of conditions and the following disclaimer.
 *  2. Redistributions in binary form must reproduce the above copyright notice,
 *         this list of conditions and the following disclaimer
 *         in the documentation and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 */

/**************************************************************************
 * include
 **************************************************************************/

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "nrf_gpio.h"
#include "nrf51_bitfields.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "app_scheduler.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "ble_error_log.h"
#include "app_gpiote.h"
#include "app_button.h"
#include "ble_debug_assert_handler.h"

#include "ble_ios.h"


/**************************************************************************
 * macro
 **************************************************************************/

/**
 * Include or not the service_changed characteristic.
 * if not enabled, the server's database cannot be changed for the lifetime of the device
 */
#define IS_SRVC_CHANGED_CHARACT_PRESENT (0)

/** Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define DEAD_BEEF                       (0xDEADBEEF)

#define ARRAY_SIZE(array)               (sizeof(array) / sizeof(array[0]))

/*
 * ピン番号
 */
/** Button : アプリ用 */
#define BUTTON_PIN_NO_APP               (19)

/** LED : Advertising中 */
#define LED_PIN_NO_ADVERTISING          (21)

/** LED : Connect中 */
#define LED_PIN_NO_CONNECTED            (26)

/** LED : Assert発生 */
#define LED_PIN_NO_ASSERT               (27)

/** LED : アプリ用 */
#define LED_PIN_NO_APP                  (16)

/*
 * Timer
 */
/** Value of the RTC1 PRESCALER register. */
#define APP_TIMER_PRESCALER             (0)

/** Maximum number of simultaneously created timers. */
#define APP_TIMER_MAX_TIMERS            (2)

/** Size of timer operation queues. */
#define APP_TIMER_OP_QUEUE_SIZE         (4)

/*
 * GPIOTEおよびButton
 */
/** Maximum number of users of the GPIOTE handler. */
#define APP_GPIOTE_MAX_USERS            (1)

/** Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */
#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)

/*
 * Scheduler
 */

/**
 * Maximum size of scheduler events.
 * Note that scheduler BLE stack events do not contain any data, as the events are being pulled from the stack in the event handler.
 */
#define SCHED_MAX_EVENT_DATA_SIZE       sizeof(app_timer_event_t)

/** Maximum number of events in the scheduler queue. */
#define SCHED_QUEUE_SIZE                (10)


/*
 * デバイス名
 *   UTF-8かつ、\0を含まずに20文字以内(20byte?)
 */
#define GAP_DEVICE_NAME                 "hiro99ma_Template"

/*
 * Appearance設定
 *  コメントアウト時はAppearance無しにするが、おそらくSoftDeviceがUnknownにしてくれる。
 *
 * Bluetooth Core Specification Supplement, Part A, Section 1.12
 * Bluetooth Core Specification 4.0 (Vol. 3), Part C, Section 12.2
 * https://developer.bluetooth.org/gatt/characteristics/Pages/CharacteristicViewer.aspx?u=org.bluetooth.characteristic.gap.appearance.xml
 * https://devzone.nordicsemi.com/documentation/nrf51/4.3.0/html/group___b_l_e___a_p_p_e_a_r_a_n_c_e_s.html
 */
//#define GAP_USE_APPEARANCE              BLE_APPEARANCE_UNKNOWN


/*
 * BLE : Advertising
 */
/* Advertising間隔[0.625msec単位] */
#define APP_ADV_INTERVAL                (64)

/* Advertisingタイムアウト時間[sec単位] */
#define APP_ADV_TIMEOUT_IN_SECONDS      (180)

/*
 * Peripheral Preferred Connection Parameters(PPCP)
 *   パラメータの意味はCore_v4.1 p.2537 "4.5 CONNECTION STATE"を参照
 *
 * connInterval : Connectionイベントの送信間隔(7.5msec～4sec)
 * connSlaveLatency : SlaveがConnectionイベントを連続して無視できる回数
 * connSupervisionTimeout :
 */
/* 最小時間[msec単位] */
#define CONN_MIN_INTERVAL               MSEC_TO_UNITS(500, UNIT_1_25_MS)

/* 最大時間[msec単位] */
#define CONN_MAX_INTERVAL               MSEC_TO_UNITS(1000, UNIT_1_25_MS)

/* slave latency */
#define CONN_SLAVE_LATENCY              (0)

/* connSupervisionTimeout[msec単位] */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)

/** sd_ble_gap_conn_param_update()を実行してから初回の接続イベントを通知するまでの時間[msec単位] */
/*
 * sd_ble_gap_conn_param_update()
 *   Central role時:
 *      Link Layer接続パラメータ更新手続きを初期化する。
 *
 *   Peripheral role時:
 *      L2CAPへ連絡要求(corresponding L2CAP request)を送信し、Centralからの手続きを待つ。
 *      接続パラメータとしてNULLが指定でき、そのときはPPCPキャラクタリスティックが使われる。
 *      ということは、Peripheralだったらsd_ble_gap_conn_param_update()は呼ばずに
 *      sd_ble_gap_ppcp_set()を呼ぶということでもよいということか？
 *
 * note:
 *      connSupervisionTimeout * 8 >= connIntervalMax * (connSlaveLatency + 1)
 */
#define CONN_FIRST_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER)

