hirokuma/nrf51822_templete/main.c
/** sd_ble_gap_conn_param_update()を呼び出す間隔[msec単位] */
#define CONN_NEXT_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)

/** Number of attempts before giving up the connection parameter negotiation. */
#define CONN_MAX_PARAMS_UPDATE_COUNT    (3)

/*
 * BLE : Security
 */
/** ペアリング要求からのタイムアウト時間[sec] */
#define SEC_PARAM_TIMEOUT               (30)

/** 1:Bondingあり 0:なし */
#define SEC_PARAM_BOND                  (1)

/** 1:ペアリング時の認証あり 0:なし */
#define SEC_PARAM_MITM                  (0)

/** IO能力
 * - BLE_GAP_IO_CAPS_DISPLAY_ONLY     : input=無し/output=画面
 * - BLE_GAP_IO_CAPS_DISPLAY_YESNO    : input=Yes/No程度/output=画面
 * - BLE_GAP_IO_CAPS_KEYBOARD_ONLY    : input=キーボード/output=無し
 * - BLE_GAP_IO_CAPS_NONE             : input/outputなし。あるいはMITM無し
 * - BLE_GAP_IO_CAPS_KEYBOARD_DISPLAY : input=キーボード/output=画面
 */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE

/** 1:OOB認証有り/0:なし */
#define SEC_PARAM_OOB                   (0)

/** 符号化鍵サイズ:最小byte(7～) */
#define SEC_PARAM_MIN_KEY_SIZE          (7)

/** 符号化鍵サイズ:最大byte(min～16) */
#define SEC_PARAM_MAX_KEY_SIZE          (16)



/**************************************************************************
 * declaration
 **************************************************************************/

/** Handle of the current connection. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;
static ble_ios_t                        m_ios;


/**************************************************************************
 * prototype
 **************************************************************************/

static void sys_evt_dispatch(uint32_t sys_evt);

/* GPIO */
static void gpio_init(void);

/* LED */
__attribute__( ( always_inline ) ) __STATIC_INLINE void led_on(int pin);
__attribute__( ( always_inline ) ) __STATIC_INLINE void led_off(int pin);

/* Timer */
static void timers_init(void);
static void timers_start(void);

/* Scheduler */
static void scheduler_init(void);

/* GPIOTEおよびButton */
static void gpiote_init(void);
static void buttons_init(void);
static void button_event_handler(uint8_t pin_no, uint8_t button_event);

static void gap_params_init(void);

static void advertising_init(void);
static void advertising_start(void);

static void services_init(void);
static void services_ios_handler_in(ble_ios_t *p_ios, uint8_t value);

static void sec_params_init(void);

static void conn_params_init(void);
static void conn_params_evt_handler(ble_conn_params_evt_t * p_evt);
static void conn_params_error_handler(uint32_t nrf_error);

static void ble_evt_handler(ble_evt_t * p_ble_evt);
static void ble_evt_dispatch(ble_evt_t * p_ble_evt);
static void ble_stack_init(void);


/**************************************************************************
 * main entry
 **************************************************************************/

/**@brief main
 */
int main(void)
{
    // 初期化
    gpio_init();
    timers_init();		//buttons_init()やble_stack_init()よりも前に呼ぶこと!

    gpiote_init();
    buttons_init();
    scheduler_init();

    ble_stack_init();

    // 処理開始
    //timers_start();
    advertising_start();

    // メインループ
    while (1) {
        //スケジュール済みイベントの実行(mainloop内で呼び出す)
        app_sched_execute();
        uint32_t err_code = sd_app_evt_wait();
        APP_ERROR_CHECK(err_code);
    }
}


/**************************************************************************
 * public function
 **************************************************************************/

/**@brief エラーハンドラ
 *
 * APP_ERROR_HANDLER()やAPP_ERROR_CHECK()から呼び出される(app_error.h)。
 * 引数は見ず、ASSERT LEDを点灯させて処理を止める。
 *
 * @param[in] error_code  エラーコード
 * @param[in] line_num    エラー発生行(__LINE__など)
 * @param[in] p_file_name エラー発生ファイル(__FILE__など)
 */
void app_error_handler(uint32_t error_code, uint32_t line_num, const uint8_t *p_file_name)
{
    //ASSERT LED点灯
    led_on(LED_PIN_NO_ASSERT);

#if 0
    //リセットによる再起動
    NVIC_SystemReset();
#else
    //留まる
    while(1) {
        __WFI();
    }
#endif
}


/**@brief SoftDeviceのASSERTハンドラ
 *
 * ASSERTした場合に呼び出される(nrf_assert.h)。
 * 条件は、DEBUG_NRFかDEBUG_NRF_USERが定義されている場合。
 * 定義されていない場合でもプロトタイプ宣言だけは残っている。
 *
 * と思ったら、softdevice_assertion_handler()が直接呼び出している(softdevice_handler.c)。
 * よって、この定義はなくすわけにはいかない。
 *
 * @param[in] line_num    エラー発生行(__LINE__など)
 * @param[in] p_file_name エラー発生ファイル(__FILE__など)
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**************************************************************************
 * private function
 **************************************************************************/

/**@brief システムイベント発生
 *
 * SoCでイベントが発生した場合にコールバックされる。
 *
 *
 * @param[in]   sys_evt   enum NRF_SOC_EVTS型(NRF_EVT_xxx). nrf_soc.hに定義がある.
 *      - NRF_EVT_HFCLKSTARTED
 *      - NRF_EVT_POWER_FAILURE_WARNING
 *      - NRF_EVT_FLASH_OPERATION_SUCCESS
 *      - NRF_EVT_FLASH_OPERATION_ERROR
 *      - NRF_EVT_RADIO_BLOCKED
 *      - NRF_EVT_RADIO_CANCELED
 *      - NRF_EVT_RADIO_SIGNAL_CALLBACK_INVALID_RETURN
 *      - NRF_EVT_RADIO_SESSION_IDLE
 *      - NRF_EVT_RADIO_SESSION_CLOSED
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    //ここでは異常発生のように扱っているが、必ずそうではないようなので、
    //実装する際には注意しよう。
    app_error_handler(DEAD_BEEF, 0, NULL);
}


/**********************************************
 * GPIO
 **********************************************/

/**
 * @brief GPIO初期化
 */
static void gpio_init(void)
{
    nrf_gpio_cfg_output(LED_PIN_NO_ADVERTISING);
    nrf_gpio_cfg_output(LED_PIN_NO_CONNECTED);
    nrf_gpio_cfg_output(LED_PIN_NO_ASSERT);
    nrf_gpio_cfg_output(LED_PIN_NO_APP);

    /* LED消灯 */
    led_off(LED_PIN_NO_ADVERTISING);
    led_off(LED_PIN_NO_CONNECTED);
    led_off(LED_PIN_NO_ASSERT);
    led_off(LED_PIN_NO_APP);
}


/**********************************************
 * LED
 **********************************************/

/**
 * @brief LED点灯
 *
 * @param[in]   pin     対象PIN番号
 */
__attribute__( ( always_inline ) ) __STATIC_INLINE void led_on(int pin)
{
    /* アクティブLOW */
    nrf_gpio_pin_clear(pin);
}


/**
 * @brief LED消灯
 *
 * @param[in]   pin     対象PIN番号
 */
__attribute__( ( always_inline ) ) __STATIC_INLINE void led_off(int pin)
{
    /* アクティブLOW */
    nrf_gpio_pin_set(pin);
}


/**********************************************
 * タイマ
 **********************************************/

/**
 * @brief タイマ初期化
 *
 * タイマ機能を初期化する。
 * 調べた範囲では、以下の機能を使用する場合には、その初期化よりも前に実行しておく必要がある。
 *  - ボタン
 *  - BLE
 */
static void timers_init(void)
{
    // Initialize timer module, making it use the scheduler
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, true);

