hirokuma/nrf51822_templete/main.c
#if 0
    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
     */
    err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
    APP_ERROR_CHECK(err_code);
#endif
}


/**
 * @brief タイマ開始
 */
static void timers_start(void)
{
#if 0
    /* YOUR_JOB: Start your timers. below is an example of how to start a timer. */
    uint32_t err_code;

    err_code = app_timer_start(m_app_timer_id, TIMER_INTERVAL, NULL);
    APP_ERROR_CHECK(err_code);
#endif
}


/**********************************************
 * Scheduler
 **********************************************/

/**
 * @brief スケジューラ初期化
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**********************************************
 * GPIOTE
 **********************************************/

/**
 * @brief GPIOTE初期化
 */
static void gpiote_init(void)
{
    APP_GPIOTE_INIT(APP_GPIOTE_MAX_USERS);
}


/**********************************************
 * Button
 **********************************************/

/**
 * @brief ボタン初期化
 *
 * @note    初期化しただけではボタンを使用できない。
 *          使用する場合はapp_button_enable()を呼び出すこと。
 */
static void buttons_init(void)
{
    // Note: SoftDeviceにアドレスが保持されるので、staticにしておくこと
    static app_button_cfg_t buttons[] = {
        { BUTTON_PIN_NO_APP, APP_BUTTON_ACTIVE_HIGH, NRF_GPIO_PIN_PULLDOWN, button_event_handler },
    };

    APP_BUTTON_INIT(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY, true);
}


/**
 * @brief ボタンイベントハンドラ
 *
 * @param[in]   pin_no         イベントが発生したピン番号
 * @param[in]   button_event   APP_BUTTON_PUSH or APP_BUTTON_RELEASE.
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_event)
{
    uint32_t err_code = NRF_SUCCESS;
    uint8_t value;

    /*
     * APPボタンを押下すると0x80を、離すと0x00を送信する。
     */
    switch (pin_no) {
    case BUTTON_PIN_NO_APP:
        if (button_event == APP_BUTTON_PUSH) {
            //push
            value = 0x80;
        }
        else {
            //release
            value = 0x00;
        }
        //Notify送信
        err_code = ble_ios_on_output(&m_ios, value);
        if ((err_code != NRF_SUCCESS) &&
          (err_code != BLE_ERROR_INVALID_CONN_HANDLE) &&
          (err_code != NRF_ERROR_INVALID_STATE)) {
            APP_ERROR_CHECK(err_code);
        }
        break;

    default:
        APP_ERROR_HANDLER(pin_no);
        break;
    }

}


/**********************************************
 * BLE : Advertising
 **********************************************/

/**
 * @brief Advertising開始
 */
static void advertising_start(void)
{
    uint32_t             err_code;
    ble_gap_adv_params_t adv_params;

    // Start advertising
    memset(&adv_params, 0, sizeof(adv_params));

    adv_params.type        = BLE_GAP_ADV_TYPE_ADV_IND;
    adv_params.p_peer_addr = NULL;
    adv_params.fp          = BLE_GAP_ADV_FP_ANY;
    adv_params.interval    = APP_ADV_INTERVAL;
    adv_params.timeout     = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = sd_ble_gap_adv_start(&adv_params);
    APP_ERROR_CHECK(err_code);
    led_on(LED_PIN_NO_ADVERTISING);
}


/**********************************************
 * BLE : Services
 **********************************************/

/**
 * @brief I/Oサービスイベントハンドラ
 *
 * @param[in]   p_ios   I/Oサービス構造体
 * @param[in]   value   受信した値
 */
static void services_ios_handler_in(ble_ios_t *p_ios, uint8_t value)
{
    if (value == 0x80) {
        //
        led_on(LED_PIN_NO_APP);
    }
    else {
        //
        led_off(LED_PIN_NO_APP);
    }
}


/**********************************************
 * BLE : Connection
 **********************************************/

/**
 * @brief Connectionパラメータモジュールイベントハンドラ
 *
 * @details Connectionパラメータモジュールでアプリに通知するイベントが発生した場合に呼ばれる。
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in]   p_evt   Connectionパラメータモジュールから受信したイベント
 */
static void conn_params_evt_handler(ble_conn_params_evt_t *p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED) {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}


/**
 * @brief Connectionパラメータエラーハンドラ
 *
 * @param[in]   nrf_error   エラーコード
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**********************************************
 * BLE stack
 **********************************************/

/**
 * @brief BLEスタックイベントハンドラ
 *
 * @param[in]   p_ble_evt   BLEスタックイベント
 */
static void ble_evt_handler(ble_evt_t *p_ble_evt)
{
    uint32_t                         err_code;
    static ble_gap_evt_auth_status_t m_auth_status;
    ble_gap_enc_info_t *             p_enc_info;

    switch (p_ble_evt->header.evt_id) {
    /*************
     * GAP event
     *************/

    //接続が成立したとき
    case BLE_GAP_EVT_CONNECTED:
        led_on(LED_PIN_NO_CONNECTED);
        led_off(LED_PIN_NO_ADVERTISING);
        m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

        //ボタンの使用を許可する
        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);
        break;

    //相手から切断されたとき
    //必要があればsd_ble_gatts_sys_attr_get()でSystem Attributeを取得し、保持しておく。
    //保持したSystem Attributeは、EVT_SYS_ATTR_MISSINGで返すことになる。
    case BLE_GAP_EVT_DISCONNECTED:
        led_off(LED_PIN_NO_CONNECTED);
        m_conn_handle = BLE_CONN_HANDLE_INVALID;

        //ボタンの使用を禁止する
        err_code = app_button_disable();
        APP_ERROR_CHECK(err_code);

        advertising_start();
        break;

    //SMP Paring要求を受信したとき
    //sd_ble_gap_sec_params_reply()で値を返したあと、SMP Paring Phase 2に状態遷移する
    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        {
            ble_gap_sec_params_t sec_param;
            sec_param.timeout      = SEC_PARAM_TIMEOUT;
            sec_param.bond         = SEC_PARAM_BOND;
            sec_param.mitm         = SEC_PARAM_MITM;
            sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
            sec_param.oob          = SEC_PARAM_OOB;
            sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
            sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
            err_code = sd_ble_gap_sec_params_reply(m_conn_handle,
                                               BLE_GAP_SEC_STATUS_SUCCESS,
                                               &sec_param);
            APP_ERROR_CHECK(err_code);
        }
        break;

